Revit 2027 API
FreeFormSetOrientationOptions Enumeration
 Orientation options for Aligned or 3D Path Free Form Rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FreeFormSetOrientationOptions
Public Enumeration FreeFormSetOrientationOptions
public enum class FreeFormSetOrientationOptions
type FreeFormSetOrientationOptions
Members
Member name | Value | Description
AlignedToDistributionPath | 0 |  Cutting planes are perpendicular to the distribution path.
ParallelToFace | 2 |  Cutting planes are parallel to a selected planar face.
PerpendicularToFace | 3 |  Cutting planes are oriented perpendicular to a selected planar face, X or Y vector being the face normal.
Vertical | 1 |  Cutting planes are oriented vertically, X or Y vector being Z axis.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace